workspace/performance/k6-run-log.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: baseline-load-test.js
        output: json (full-results.json)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

     ✓ health check successful

     checks.........................: 100.00% ✓ 100       ✗ 0   
     data_received..................: 158 kB  15 kB/s
     data_sent......................: 146 kB  14 kB/s
   ✓ error_rate.....................: 0.00%   ✓ 0         ✗ 0   
     http_req_blocked...............: avg=20.21µs min=1.1µs  med=2.6µs    max=948.19µs p(90)=4.89µs   p(95)=8.75µs  
     http_req_connecting............: avg=8.98µs  min=0s     med=0s       max=686.39µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=19.29ms min=2.43ms med=4.52ms   max=458.44ms p(90)=15.79ms  p(95)=29.73ms 
       { expected_response:true }...: avg=45.55ms min=3.3ms  med=5.72ms   max=458.44ms p(90)=58.25ms  p(95)=361.11ms
     http_req_failed................: 66.66%  ✓ 200       ✗ 100 
     http_req_receiving.............: avg=199.5µs min=42.5µs med=173.69µs max=1.78ms   p(90)=278.18µs p(95)=338.02µs
     http_req_sending...............: avg=20.8µs  min=5.59µs med=16.5µs   max=127.69µs p(90)=25.91µs  p(95)=43.2µs  
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=19.07ms min=2.23ms med=4.3ms    max=458.23ms p(90)=15.56ms  p(95)=29.28ms 
     http_reqs......................: 300     28.047221/s
     iteration_duration.............: avg=1.05s   min=1s     med=1.01s    max=1.47s    p(90)=1.08s    p(95)=1.41s   
     iterations.....................: 100     9.349074/s
     success_count..................: 200     18.698148/s
     vus............................: 10      min=10      max=10
     vus_max........................: 10      min=10      max=10
   ✓ work_create_latency_ms.........: avg=7.18    min=3      med=4        max=46       p(90)=15       p(95)=26.2    
   ✓ work_get_latency_ms............: avg=5.4     min=2      med=4        max=46       p(90)=8        p(95)=15      


running (10.7s), 00/10 VUs, 100 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s